[
   "posts": [
      {
        "id": "1",
        "title": "Holokratie - Ein Erfahrungsbericht",
        "date": "16. Januar 2021",
        "summary": "Zorn. Furcht. Aggressivität. Die Dunklen Seiten der Macht sind sie. Besitz ergreifen  sie leicht von dir. Nach meinem letzten Beitrag zur Holokratie…",
        "text": "<h2 className=\"pb-3\">Zorn. Furcht. Aggressivität. Die Dunklen Seiten der Macht sind sie. Besitz ergreifen sie leicht von dir.</h2><p>Nach meinem letzten Beitrag zur Holokratie (oder auch Holokratie) und zu Erfahrungen damit bekam ich eine PN mit der Frage, ob ich Lust zu einem Zoom zu dem Thema hätte. Mein Gegenüber, ein guter alter Bekannter, hatte damit Erfahrungen bei seinem alten Arbeitgeber gemacht. Und er wollte sie mit mir teilen, jedoch nicht öffentlich darüber reden.</p><p>Somit erzähle ich jetzt davon.</p><p>Erstmal: Holokratie kann wirklich die gewünschten Effekte haben. Effektive Meetings, eine Kultur der Selbst-Bestimmtheit und -Verantwortung, klare Zuständigkeiten und Entscheidungsfreiheit für eben diese.</p><p>Großartig, genau das, was ich mir vorstelle für mein Team!</p><p>Es gibt aber auch die Dunkle Seite. Die, bei der aus Effektivität einsame Inseln werden und aus klarer Verantwortung Aggressivität gegenüber den anderen, die ihrer vermeintlich nicht nachkommen.</p><p>Aus einem Team wird so ein Haufen von Eigenbrötlern, eingekapselt in ihrem Verantwortungsbereich. Aus strukturierter Kommunikation wird „Du musst…“, „Warum hast du nicht…“ und „Das ist doch dein Bereich“.</p><p>Absprache gibt es, wie sie die Holokratie in den Gremien vorsieht. Aber eine Neben-Kultur mit alten Strukturen bleibt erhalten.\nEs gibt zwar keine fachlichen Führungskräfte oder Abteilungsleiter mehr, aber weiterhin disziplinarische Vorgesetzte, die mit Daumen rauf | Daumen runter entscheiden.</p><p>Dabei hatten alle Mitarbeiter doch einen 2-Tageskurs zur Holokratie gemacht, wussten worum es geht. Auch die Führungsebene war davon überzeugt, dass Holokratie der richtige Weg ist.</p><p>Nur wurde es nicht gelebt. Oder besser: nicht richtig!</p><p>Der 2-Tageskurs war gut, aber eben nicht ausreichend. Es fand kein weiteres Mentoring statt. Und somit versiegten die guten Anfänge im Sande. Ein Klassiker also.</p><p>Aber es ist wohl auch eine Frage der Mentalität. In einem ‚ur-deutschen‘ Unternehmen mit wenig Diversität der Kulturen lässt sich so eine neue Art zu denken und zu handeln schwer einführen. Auf meine Frage, ob mein Bekannter sich vorstellen könnte, Holokratie in seinem neuen, multikulturell-geprägten Unternehmen einzuführen, bejahte er das. Es sei zumindest besser vorstellbar, dass es klappen könnte. Auch wenn es aus seiner Sicht nicht nötig sei, da er bereits in seiner Rolle als Manager einen Servant Leadership-Ansatz pflege und sein Team selbstbestimmt arbeite.</p><p>Eine weitere Rolle spielt wohl auch die Einstellung vieler Arbeitnehmer, keine Verantwortung tragen zu WOLLEN. Eine Ameise unter vielen. Fleißige Biene anstatt Koenigin im eigenen Stock. Das machte es aus seiner Sicht auch nicht gerade leicht. Verantwortung zu verteilen, ohne dass sie getragen wird, führt zu Chaos. Und damit zu Zorn.</p><h3><b>Tue es oder tue es nicht. Es gibt kein Versuchen. - Yoda -</b></h3><p>Das ist das Fazit für mich. Ganz oder garnicht. Alles andere wird nicht funktionieren.</p><p>Holokratie lässt sich am einfachsten umsetzen, wenn man von Anfang an damit startet. Bei KaiserKoenig wäre das gegeben. Pluspunkte auf meiner Seite. Noch habe ich keine Mitarbeiter.</p><p>Es bedarf aber auch einer gewissen Einstellung der Mitarbeiter, eine Art unternehmerisches Denken. Weg von der Arbeiter-Biene, hin zur Koenigin. Sind dann Ex-Freelancer die besseren Angestellten? Möglicherweise! Zumindest haben sie für sich eine Zeitlang entschieden, Verantwortung zu übernehmen für ihr Unternehmen. Großer Pluspunkt.</p><p>Zu guter letzt muss Holokratie aber auch als Werkzeug verstanden werden, was man ständig einsetzen muss. Übung macht den Meister. Bis die Macht mit dir ist und es in Fleisch und Blut übergegangen ist. Harte Arbeit, die getan werden muss.</p><p>Und man muss der Dunkle Seite widerstehen. Wir wissen alle, wo das sonst hinführt.</p><p>Ich denke aber, es lohnt sich, der Holokratie eine Chance zu geben. Auf geht’s.</p><h3><b>Viel zu lernen du noch hast!</b></h3><p>#holacracy #servantLeadership</p>\n    "
      },
      {
        "id": "2",
        "title": "Ein Blick in die Glaskugel",
        "date": "06. Januar 2021",
        "summary": "Nein, dass wird keiner dieser Ausblicke in die Jahresplanung 2021 und die Ziele von KaiserKoenig. Machen alle, will aber eigentlich kaum einer lesen…",
        "text": "<p>Nein, dass wird keiner dieser Ausblicke in die Jahresplanung 2021 und die Ziele von KaiserKoenig.</p><p>Machen alle, will aber eigentlich kaum einer lesen.</p><p>Es geht um die Zukunft der Frontends.</p><p>Nach dem letzten 1 more thing, das die Welt so nachhaltig verändert hat und dem damit verbundenen Siegeszugs der Smartphones allgemein, sollen nun doch Smarte Brillen das nächste große Ding werden. Zumindest soll Apple angeblich noch dieses Jahr eine eigene SmartGlas auf den Markt bringen.</p><p>Und genau wie für Smartphone gilt es dann die Frontends auf diese neue Geräteklasse anzupassen, neue Techniken zu überlegen, um die UX möglichst hoch zu halten.</p><p>Heute steuern MediaQueries Ansichten für verschiedene Bildschirmgrößen und Orientierungen und integrieren seit neuerem den DarkMode.</p><p>Wir unterscheiden zwischen MouseOver, Click, LongClick und DoubleClick, je nach Gerät.</p><p>Sensitive Oberflächen machen es komplexer in der Entwicklung, erhöhen aber auch deutlich die Möglichkeiten. Von 2D zu 3D.</p><p>In Zukunft werden wir uns als Entwickler (und natürlich Designer als Sparingpartner) wohl fragen müssen, wie stark transparent eine Ebene sein muss oder darf, ob sie im linken oder rechten Auge angezeigt wird (ltr oder rtl ?!).</p><p>Wie wir den Augenaufschlag mit XXL-Wimpern abfragen. Ist es ein Click oder doch ein DoubleClick. Oder doch nur eine nette Geste zum Gegenüber.</p><p>Wie scrollen und verschieben wir Fenster.</p><p>Und wie interagieren wir im Raum?</p><p>Und die Frage aller Fragen: Wie gelingt der Übergang Brille - Mobile - Desktop? Weiterhin eins für alle? Oder doch jeder sein eigenes Süppchen?</p><p>Alles spannend. Alles Neu. Aber auch dafür wird es Lösungen geben.</p><p>Ich freue mich drauf.</p><p>#frontendIsKing</p><p>HUD by <a href=\"https://www.vecteezy.com/free-vector/graphic\">https://www.vecteezy.com/free-vector/graphic</a></p>\n    "
      },
      {
        "id": "3",
        "title": "Vom Generalisten zum Spezialisten",
        "date": "27. Dezember 2020",
        "summary": "Ein Jahre(s)Rückblick. 20 Jahre, um genau zu sein! So lange mache ich das ganze schon. Am Anfang war ich die eierlegende Woll-Milch-Sau. Design, PHP…",
        "text": "\n    <h2 className=\"pb-3\">Ein Jahre(s)Rückblick.</h2><p>20 Jahre, um genau zu sein!</p><p>So lange mache ich das ganze schon.</p><p>Am Anfang war ich die eierlegende Woll-Milch-Sau. Design, PHP, Datenbanken, HTML mit Frames und Tabellen. Alles habe ich gemacht. Mehr als jeder Fullstack-Developer heute.</p><p>Ich habe eigene CMS für meine Kunden gecoded. Eine ganze Verwaltungssoftware mit Skills-Datenbanken für Freelancer und Projekte. Hat heute sowas jede kleine Recruiting-Firma im Einsatz. Das Design kam auch aus meiner Hand. Photoshop lässt grüßen.</p><p>Und dann?</p><p>Dann kam CSS. So klammheimlich um Ecke. Ich wurde Mitglied einer Online-Community. Strohhalm.org. Webseiten wurden jetzt mit DIVs gebaut, CSS kam in separate Dateien.</p><p>Und der Koenig wurde zum Frontendler.</p><p>Die wurden damals noch belächelt. HTML programmiert man ja nicht. Kann ja jeder. CSS das selbe. Aber irgendwie waren SIE alle glücklich, dass ich das machte... die waren, echten Programmierer. Dann mussten sie sich nicht mehr mit Pixel-Schubsen und Designern rumärgern, die ja von Code nix verstanden. Dem einzigen, was letztlich zählte für sie. Usability? Egal. Design? Muss ja. Aber macht jetzt der Koenig.</p><p>JavaScript wurde vom Bösewicht zu DEM Tool des Web 2.0. Prototype, script.aculo.us und dann jQuery. Für OTTO, GelbeSeiten, ElitePartner und wie sie alle hießen. KaiserKoenig wurde 2007 geboren und 2000 Zeilen main.js verstand keiner mehr, außer dem Kaiser* und mir. 3 Mann-Wochen Feature-Entwicklung für die Tonne, weil es auf einem von 16 Vorstands-PCs trotz Browser-Weiche im IE 6 nicht lief. Danke Microsoft dafür.</p><p>Und Heute? Heute heißen Sie React, Angular oder Vue und sind nicht mehr wegzudenken. Die JavaScript- Frameworks haben sie geändert. Man baut jetzt auch Native Apps damit. Frontend wird dank Node.js wieder mehr zu Backend. Gerade neulich kam ein Artikel über React Server Components. Sehr spannend, sehr komplex! Nix mehr nur mit Frontend. Schon lange nicht mehr.</p><p>Aber es gibt sie noch. Diejenigen, die wie damals lieber Pixel schubsen. Und weil es alles komplizierter ist werden sie nun UX Engineer genannt. Und Ich muss wohl wieder meine Jobbezeichnung ändern. Klingt besser. Ist aber „still good old HTML, CSS and JavaScript“. Denn sie kochen alle nur mit heißem Wasser.</p><p>#frontend #frontendIsKing #frontendLove #rückblick #bewegtesLeben #spassbeiderarbeit</p><p>*Den Kaiser gibt es übrigens wirklich. Und wenn es Corona zulässt trinken wir noch immer gerne ein Bier und essen Currywurst zusammen. Reden über die gute alte Zeit wie ich jetzt hier.</p>"
      }
    ]
]
